



Network Working Group                                           O. Friel
Internet-Draft                                                 R. Barnes
Intended status: Standards Track                                   Cisco
Expires: September 10, 2021                                 T. Hollebeek
                                                                DigiCert
                                                           M. Richardson
                                                Sandelman Software Works
                                                          March 09, 2021


                          ACME for Subdomains
                     draft-friel-acme-subdomains-04

Abstract

   This document outlines how ACME can be used by a client to obtain a
   certificate for a subdomain identifier from a certification
   authority.  The client has fulfilled a challenge against a parent
   domain but does not need to fulfill a challenge against the explicit
   subdomain as certificate policy allows issuance of the subdomain
   certificate without explicit subdomain ownership proof.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on September 10, 2021.

Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents



Friel, et al.          Expires September 10, 2021               [Page 1]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   2
   3.  ACME Workflow and Identifier Requirements . . . . . . . . . .   3
   4.  ACME Issuance of Subdomain Certificates . . . . . . . . . . .   5
     4.1.  ACME Challenge Type . . . . . . . . . . . . . . . . . . .   5
     4.2.  Parent Domain Control Indication  . . . . . . . . . . . .   5
     4.3.  Pre-Authorization . . . . . . . . . . . . . . . . . . . .   7
     4.4.  Illustrative Call Flow  . . . . . . . . . . . . . . . . .   7
     4.5.  newOrder and newAuthz Handling  . . . . . . . . . . . . .   8
     4.6.  Examples  . . . . . . . . . . . . . . . . . . . . . . . .   9
   5.  Resource Enhancements . . . . . . . . . . . . . . . . . . . .  10
     5.1.  Authorization Object  . . . . . . . . . . . . . . . . . .  10
     5.2.  Identifier Object . . . . . . . . . . . . . . . . . . . .  10
     5.3.  Directory Object Metadata . . . . . . . . . . . . . . . .  11
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  11
     6.1.  Authorization Object Fields Registry  . . . . . . . . . .  11
     6.2.  Directory Object Metadata Fields Registry . . . . . . . .  11
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .  11
     7.1.  ACME Server Policy Considerations . . . . . . . . . . . .  12
   8.  Informative References  . . . . . . . . . . . . . . . . . . .  13
   Appendix A.  CA Browser Forum Baseline Requirements Extracts  . .  14
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  14

1.  Introduction

   ACME [RFC8555] defines a protocol that a certification authority (CA)
   and an applicant can use to automate the process of domain name
   ownership validation and X.509v3 (PKIX) [RFC5280] certificate
   issuance.  This document outlines how ACME can be used to issue
   subdomain certificates, without requiring the ACME client to
   explicitly fulfill an ownership challenge against the subdomain
   identifiers - the ACME client need only fulfill an ownership
   challenge against a parent domain identifier.

2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP




Friel, et al.          Expires September 10, 2021               [Page 2]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

   The following terms are defined in the CA/Browser Forum Baseline
   Requirements [CAB] and are reproduced here:

   o  Base Domain Name: The portion of an applied-for FQDN that is the
      first domain name node left of a registry-controlled or public
      suffix plus the registry-controlled or public suffix (e.g.
      "example.co.uk" or "example.com").  For FQDNs where the right-most
      domain name node is a gTLD having ICANN Specification 13 in its
      registry agreement, the gTLD itself may be used as the Base Domain
      Name.

   o  ADN: Authorization Domain Name.  The Domain Name used to obtain
      authorization for certificate issuance for a given FQDN.

   o  Domain Name: The label assigned to a node in the Domain Name
      System

   o  Domain Namespace: The set of all possible Domain Names that are
      subordinate to a single node in the Domain Name System

   The following terms are used in this document:

   o  CA: Certification Authority

   o  CSR: Certificate Signing Request

   o  FQDN: Fully Qualified Domain Name

   o  Parent Domain: a node in the Domain Name System that has a Domain
      Name

   o  Subdomain: a Domain Name that is in the Domain Namespace of a
      given Parent Domain

3.  ACME Workflow and Identifier Requirements

   A typical ACME workflow for issuance of certificates is as follows:

   1.  client POSTs a newOrder request that contains a set of
       "identifiers"

   2.  server replies with a set of "authorizations" and a "finalize"
       URI





Friel, et al.          Expires September 10, 2021               [Page 3]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   3.  client sends POST-as-GET requests to retrieve the
       "authorizations", with the downloaded "authorization" object(s)
       containing the "identifier" that the client must prove that they
       control

   4.  client proves control over the "identifier" in the
       "authorization" object by completing the specified challenge, for
       example, by publishing a DNS TXT record

   5.  client POSTs a CSR to the "finalize" API

   6.  server replies with an updated order object that includes a
       "certificate" URI

   7.  client sends POST-as-GET request to the "certificate" URI to
       download the certificate

   ACME places the following restrictions on "identifiers":

   o  section 7.1.3: The authorizations required are dictated by server
      policy; there may not be a 1:1 relationship between the order
      identifiers and the authorizations required.

   o  section 7.1.4: the only type of "identifier" defined by the ACME
      specification is a fully qualified domain name: "The only type of
      identifier defined by this specification is a fully qualified
      domain name (type: "dns").  The domain name MUST be encoded in the
      form in which it would appear in a certificate."

   o  Section 7.4: the "identifier" in the CSR request must match the
      "identifier" in the newOrder request: "The CSR MUST indicate the
      exact same set of requested identifiers as the initial newOrder
      request."

   o  Sections 8.3: the "identifier", or FQDN, in the "authorization"
      object must be used when fulfilling challenges via HTTP:
      "Construct a URL by populating the URL template ... where the
      domain field is set to the domain name being verified"

   o  Section 8.4: the "identifier", or FQDN, in the "authorization"
      object must be used when fulfilling challenges via DNS: "The
      client constructs the validation domain name by prepending the
      label "_acme-challenge" to the domain name being validated."

   ACME does not mandate that the "identifier" in a newOrder request
   matches the "identifier" in "authorization" objects.





Friel, et al.          Expires September 10, 2021               [Page 4]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


4.  ACME Issuance of Subdomain Certificates

   As noted in the previous section, ACME does not mandate that the
   "identifier" in a newOrder request matches the "identifier" in
   "authorization" objects.  This means that the ACME specification does
   not preclude an ACME server processing newOrder requests and issuing
   certificates for a subdomain without requiring a challenge to be
   fulfilled against that explicit subdomain.

   ACME server policy could allow issuance of certificates for a
   subdomain to a client where the client only has to fulfill an
   authorization challenge for a parent domain of that subdomain.  This
   allows a flow where a client proves ownership of, for example,
   "example.org" and then successfully obtains a certificate for
   "sub.example.org".

   ACME server policy is out of scope of this document, however some
   commentary is provided in Section 7.1.

4.1.  ACME Challenge Type

   ACME for subdomains is restricted for use with "dns-01" challenges.
   If a server policy allows a client to fulfill a challenge against a
   parent ADN of a requested certificate FQDN identifier, then the
   server MUST issue a "dns-01" challenge against that parent ADN.

4.2.  Parent Domain Control Indication

   Clients need a mechanism to optionally indicate to servers whether or
   not they are authorized to fulfill challenges against parent ADNs for
   a given identifier FQDN.  For example, if a client places an order
   for an identifier "foo.bar.example.org", but the client is not
   authorized to update DNS TXT records against the parent ADNs
   "bar.example.org" or "example.org", then we want to avoid the server
   sending a challenge against those ADNs.

   This can be achieved by adding an optional boolean
   "parentDomainAuthorization" flag to the "identifiers" field in the
   order object.  This boolean flag indicates whether the client has
   control of all parent ADNs and can fulfill challenges against all
   parent domains.

   In the following example, the client requests a certificate for
   identifier "foo.bar.example.org" and indicates that it can fulfill a
   challenge against the FQDN or any of the parent ADNs
   "bar.example.org" or "example.org".  The server can then choose which
   of the ADNs to issue a challenge against.




Friel, et al.          Expires September 10, 2021               [Page 5]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


  {
    "identifiers": [
      { "type": "dns", "value": "foo.bar.example.org", "parentDomainAuthorization": true }
    ],
    "notBefore": "2016-01-01T00:04:00+04:00",
    "notAfter": "2016-01-08T00:04:00+04:00"
   }

   If the client is unable to fulfill, authorizations against parent
   ADNs, the client should include this flag set to "false".  When a
   server receives an order with this flag set against an identifier, it
   MUST NOT issue an authorization challenge against any of the
   identifier's parent ADNs.

   For example, if a client places an order for "foo.bar.example.org"
   but does not have control over parent domains "bar.example.org" or
   "example.org", the client should send the following order object:

  {
    "identifiers": [
      { "type": "dns", "value": "foo.bar.example.org", "parentDomainAuthorization": false },
    ],
    "notBefore": "2016-01-01T00:04:00+04:00",
    "notAfter": "2016-01-08T00:04:00+04:00"
   }

   If a client does not explicitly specify a value for
   "parentDomainAuthorization", then no default value is assumed.

   [TODO] Is this granular enough?  Is there any need for a client to be
   able to specify a subset of parent ADNs it has control over? e.g. if
   a client wants a cert for "foo.bar.example.org" and has control over
   "bar.example.org" but not "example.org".

     {
       "identifiers": [
         { "type": "dns",
           "value": "foo.bar.example.org"
           "adns": [
             "foo.bar.example.org",
             "bar.example.org"
           ]
         }
       ],
       "notBefore": "2016-01-01T00:04:00+04:00",
       "notAfter": "2016-01-08T00:04:00+04:00"
     }




Friel, et al.          Expires September 10, 2021               [Page 6]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


4.3.  Pre-Authorization

   The standard ACME workflow has authorization objects created
   reactively in response to a certificate order.  ACME also allows for
   pre-authorization, where clients obtain authorization for an
   identifier proactively, outside of the context of a specific
   issuance.  This document allows for both workflows, and Section 4.5
   outlines how the ACME server handles newOrder and newAuthz requests
   for both workflows.

   It may make sense to use the ACME pre-authorization flow for the
   subdomain use case, however, that is an operator implementation and
   deployment decision.  With the ACME pre-authorization flow, the
   client could pre-authorize for the parent domain once, and then issue
   multiple newOrder requests for certificates for multiple subdomains.

4.4.  Illustrative Call Flow

   The call flow illustrated here uses the ACME pre-authorization flow.
   The call flow also illustrates the DNS-based proof of ownership
   mechanism, but the subdomain workflow is equally valid for HTTP based
   proof of ownership.

   +--------+             +------+     +-----+
   | Client |             | ACME |     | DNS |
   +--------+             +------+     +-----+
       |                      |           |
    STEP 1: Pre-Authorization of parent domain
       |                      |           |
       | POST /newAuthz       |           |
       | "example.org"        |           |
       |--------------------->|           |
       |                      |           |
       | 201 authorizations   |           |
       |<---------------------|           |
       |                      |           |
       | Publish DNS TXT      |           |
       | "example.org"        |           |
       |--------------------------------->|
       |                      |           |
       | POST /challenge      |           |
       |--------------------->|           |
       |                      | Verify    |
       |                      |---------->|
       | 200 status=valid     |           |
       |<---------------------|           |
       |                      |           |
       | Delete DNS TXT       |           |



Friel, et al.          Expires September 10, 2021               [Page 7]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


       | "example.org"        |           |
       |--------------------------------->|
       |                      |           |
    STEP 2: Place order for subdomain
       |                      |           |
       | POST /newOrder       |           |
       | "sub.example.org"    |           |
       |--------------------->|           |
       |                      |           |
       | 201 status=ready     |           |
       |<---------------------|           |
       |                      |           |
       | POST /finalize       |           |
       | CSR "sub.example.org"|           |
       |--------------------->|           |
       |                      |           |
       | 200 OK status=valid  |           |
       |<---------------------|           |
       |                      |           |
       | POST /certificate    |           |
       |--------------------->|           |
       |                      |           |
       | 200 OK               |           |
       | PKI "sub.example.org"|           |
       |<---------------------|           |


4.5.  newOrder and newAuthz Handling

   Servers may consider validation of a parent domain sufficient
   authorization for a subdomain.  If a server has such a policy and a
   client has already fulfilled an authorization challenge for the
   parent domain then:

   o  If the client submits a newAuthz request for a subdomain: The
      server MUST return status 200 (OK) response.  The response body is
      the existing authorization object for the parent domain with
      status set to "valid".

   o  If the client submits a newOrder request for a subdomain: The
      server MUST return a 201 (Created) response.  The response body is
      an order object with status set to "ready" and links to the
      unexpired authorizations against the parent domain.

   If a server has such a policy and a client has not fulfilled an
   authorization challenge for the parent domain then:





Friel, et al.          Expires September 10, 2021               [Page 8]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   o  If the client submits a newAuthz request for a subdomain: The
      server MUST return a status 201 (Created) response.  If the client
      indicates that it has control over the parent domains by including
      the "parentDomainAuthorization" value of "true", then the response
      body is a newly created authorization object, and server policy
      dictates whether the authorization object is for the subdomain
      identifier, or one of the parent domains.  If the client indicates
      that it does not have control over the parent domain by including
      the "parentDomainAuthorization" value of "false", then server MUST
      return an authorization object for the specified identifier, and
      not for a parent domain.

   o  If the client submits a newOrder request for a subdomain: The
      server MUST return a status 201 (Created) response.  If the client
      indicates that it has control over the parent domains by including
      the "parentDomainAuthorization" value of "true", then the response
      body is an order object with status set to "pending" and links to
      newly created authorizations object, and server policy dictates
      whether the authorization object is for the subdomain identifier,
      or one of the parent domains.  If the client indicates that it
      does not have control over the parent domain by including the
      "parentDomainAuthorization" value of "false", then server MUST
      return an authorization object for the specified identifier, and
      not for a parent domain.

4.6.  Examples

   In order to illustrate subdomain behaviour, let us assume that a
   client wishes to get certificates for subdomain identifiers
   "sub0.example.org", "sub1.example.org" and "sub2.example.org" under
   parent domain "example.org", and CA policy allows certificate
   issuance of these subdomain identifiers while only requiring the
   client to fulfill an ownership challenge for parent domain
   "example.org".  Let us also assume that the client has not yet proven
   ownership of parent domain "example.org".

   1.  The client POSTs a newOrder request for identifier
       "sub0.example.org" and includes a "parentDomainAuthorization"
       value of "true"

       The server creates an authorization object for identifier
       "example.org".  The server replies with a 201 (Created) response.
       The response body is an order object with status set to "pending"
       and a link to newly created authorization object against the
       parent domain "example.org".  Therefore, the server is
       instructing the client to fulfill a challenge against domain
       identifier "example.org" in order to obtain a certificate
       including identifier "sub0.example.org".



Friel, et al.          Expires September 10, 2021               [Page 9]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


       The client completes the challenge for "example.org", POSTs a CSR
       to the order finalize URI, and downloads the certificate.

   2.  The client POSTs a newOrder request for identifier
       "sub1.example.org"

       The server replies with a 201 (Created) response.  The response
       body is an order object with status set to "ready" and a link to
       the unexpired authorization against the parent domain
       "example.org".

       The client POSTs a CSR to the order finalize URI, and downloads
       the certificate.

   3.  The client POSTs a newAuthz request for identifier
       "sub2.example.org"

       The server replies with a 200 (OK) response.  The response body
       is the previously created authorization object for "example.org"
       with status set to "valid".

5.  Resource Enhancements

   This document defines enhancements to the authorization and directory
   objects.

5.1.  Authorization Object

   If an ACME server allows issuance of certificates for subdomains of a
   parent domain, then the authorization object for the parent domain
   MUST include the optional "includeSubDomains" field, with a value of
   true.

   The structure of an ACME authorization resource is enhanced to
   include the following optional field:

   includeSubDomains (optional, boolean): This field MUST be present and
   true for authorizations where ACME server policy allows certificates
   to be issued for subdomains of the identifier in the authorization
   object without explicit authorization of the subdomain

5.2.  Identifier Object

   The "Identifier" object which can be included in requests to newAuthz
   resource, and in order objects, is enhanced to include the following
   optional field:





Friel, et al.          Expires September 10, 2021              [Page 10]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   parentDomainAuthorization (optional, boolean): Clients include this
   field to indicate if they have control over parent domains for the
   specified identifier and are able to fulfill challenges against
   parent domains of the identifier.  If not specified, then no default
   value is assumed

5.3.  Directory Object Metadata

   An ACME server can advertise support of issuance of subdomain
   certificates by including the boolean field
   "includeSubDomainsAuthorization" in its "ACME Directory Metadata
   Fields" registry.  If not specified, then no default value is
   assumed.  If an ACME server supports issuance of subdomain
   certificates, it can indicate this by including this field with a
   value of "true".

6.  IANA Considerations

6.1.  Authorization Object Fields Registry

   The following field is added to the "ACME Authorization Object
   Fields" registry defined in ACME [RFC8555].

       +-------------------+------------+--------------+-----------+
       | Field Name        | Field Type | Configurable | Reference |
       +-------------------+------------+--------------+-----------+
       | includeSubDomains | boolean    | false        | RFC XXXX  |
       +-------------------+------------+--------------+-----------+

6.2.  Directory Object Metadata Fields Registry

   The following field is added to the "ACME Directory Metadata Fields"
   registry defined in ACME [RFC8555].

        +--------------------------------+------------+-----------+
        | Field Name                     | Field Type | Reference |
        +--------------------------------+------------+-----------+
        | includeSubDomainsAuthorization | boolean    | RFC XXXX  |
        +--------------------------------+------------+-----------+

7.  Security Considerations

   This document documents enhancements to ACME [RFC8555] that optimize
   the protocol flows for issuance of certificates for subdomains.  The
   underlying goal of ACME for Subdomains remains the same as that of
   ACME: managing certificates that attest to identifier/key bindings
   for these subdomains.  Thus, ACME for Subdomains has the same two
   security goals as ACME:



Friel, et al.          Expires September 10, 2021              [Page 11]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   1.  Only an entity that controls an identifier can get an
       authorization for that identifier

   2.  Once authorized, an account key's authorizations cannot be
       improperly used by another account

   ACME for Subdomains makes no changes to:

   o  account or account key management

   o  ACME channel establishment, security mechanisms or threat model

   o  Validation channel establishment, security mechanisms or threat
      model

   Therefore, all Security Considerations in ACME in the following areas
   are equally applicable to ACME for Subdomains:

   o  Threat Model

   o  Integrity of Authorizations

   o  Denial-of-Service Considerations

   o  Server-Side Request Forgery

   o  CA Policy Considerations

   Some additional comments on ACME server policy are given in the
   following section.

7.1.  ACME Server Policy Considerations

   The ACME for Subdomains and the ACME specifications do not mandate
   any specific ACME server or CA policies, or any specific use cases
   for issuance of certificates.  For example, an ACME server could be
   used:

   o  to issue Web PKI certificates where the ACME server must comply
      with CA/Browser Forum [CAB] Baseline Requirements.

   o  as a Private CA for issuance of certificates within an
      organisation.  The organisation could enforce whatever policies
      they desire on the ACME server.

   o  for issuance of IoT device certificates.  There are currently no
      IoT device certificate policies that are generally enforced across




Friel, et al.          Expires September 10, 2021              [Page 12]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


      the industry.  Organizations issuing IoT device certificates can
      enforce whatever policies they desire on the ACME server.

   ACME server policy could specify whether:

   o  issuance of subdomain certificates is allowed based on proof of
      ownership of a parent domain

   o  issuance of subdomain certificates is allowed, but only for a
      specific set of parent domains

   o  whether DNS based proof of ownership, or HTTP based proof of
      ownership, or both, are allowed

   ACME server policy specification is explicitly out of scope of this
   document.  For reference, extracts from CA/Browser Forum Baseline
   Requirements are given in the appendices.

8.  Informative References

   [CAB]      CA/Browser Forum, "Baseline Requirements for the Issuance
              and Management of Publicly-Trusted Certificates", n.d.,
              <https://cabforum.org/wp-content/uploads/CA-Browser-Forum-
              BR-1.7.1.pdf>.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC5280]  Cooper, D., Santesson, S., Farrell, S., Boeyen, S.,
              Housley, R., and W. Polk, "Internet X.509 Public Key
              Infrastructure Certificate and Certificate Revocation List
              (CRL) Profile", RFC 5280, DOI 10.17487/RFC5280, May 2008,
              <https://www.rfc-editor.org/info/rfc5280>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8555]  Barnes, R., Hoffman-Andrews, J., McCarney, D., and J.
              Kasten, "Automatic Certificate Management Environment
              (ACME)", RFC 8555, DOI 10.17487/RFC8555, March 2019,
              <https://www.rfc-editor.org/info/rfc8555>.







Friel, et al.          Expires September 10, 2021              [Page 13]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


Appendix A.  CA Browser Forum Baseline Requirements Extracts

   The CA/Browser Forum Baseline Requirements [CAB] allow issuance of
   subdomain certificates where authorization is only required for a
   parent domain.  Baseline Requirements version 1.7.1 states:

   o  Section: "1.6.1 Definitions": Authorization Domain Name: The
      Domain Name used to obtain authorization for certificate issuance
      for a given FQDN.  The CA may use the FQDN returned from a DNS
      CNAME lookup as the FQDN for the purposes of domain validation.
      If the FQDN contains a wildcard character, then the CA MUST remove
      all wildcard labels from the left most portion of requested FQDN.
      The CA may prune zero or more labels from left to right until
      encountering a Base Domain Name and may use any one of the
      intermediate values for the purpose of domain validation.

   o  Section: "3.2.2.4.6 Agreed-Upon Change to Website": Once the FQDN
      has been validated using this method, the CA MAY also issue
      Certificates for other FQDNs that end with all the labels of the
      validated FQDN.  This method is suitable for validating Wildcard
      Domain Names.

   o  Section: "3.2.2.4.7 DNS Change": Once the FQDN has been validated
      using this method, the CA MAY also issue Certificates for other
      FQDNs that end with all the labels of the validated FQDN.  This
      method is suitable for validating Wildcard Domain Names.

Authors' Addresses

   Owen Friel
   Cisco

   Email: ofriel@cisco.com


   Richard Barnes
   Cisco

   Email: rlb@ipv.sx


   Tim Hollebeek
   DigiCert

   Email: tim.hollebeek@digicert.com






Friel, et al.          Expires September 10, 2021              [Page 14]

Internet-Draft               ACME-SUBDOMAINS                  March 2021


   Michael Richardson
   Sandelman Software Works

   Email: mcr+ietf@sandelman.ca















































Friel, et al.          Expires September 10, 2021              [Page 15]
